# '================SET=============='
# #множество -изменяемый неупорядоченнный итерируемый неиндексируемый тип данных предназначенный для  хранения уникальных значений
# Множества могут хранить в себе только неизменяемые типы данных если же в set использовать () tuple то внутри  tuple  не должно быть изменяемого типа данных 
# set1{1,2,3,4,5,6,7,8,9,'hello',None}1


# '============FIF0/LIFO============='
# #FIFO-first in first out 
# #LIFO-last in first out 

# set_={1,2,3,4,2}
# print(set_)



# Удаление элемента из множеств

# Элементы могут быть удалены при помощи обоих методов discard() и remove() . Помните, что метод discard() не будет выдавать ошибку, если элемент не был найден во множестве. Однако, если метод remove() используется и элемент не был найден, возникнет ошибка.